boost/jmeter/advanced-scenarios.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Advanced Scenarios - Idempotency, Soak, Stress, Chaos">
      <stringProp name="TestPlan.comments">Phase 4: Idempotency (cùng transactionId nhiều lần → chỉ 1 SUCCESS, còn lại DUPLICATE_TRANSACTION).
Phase 5: Soak/Endurance (30 phút, virtual lock, 200 users) để phát hiện memory leak, conn pool leak.
Phase 6: Stress step load (100 → 500 → 1000 → 2000 users) để tìm knee-point.
Phase 7: Chaos - dùng chung P3 profile, chạy kèm scripts/chaos/*.sh để inject failure.

IMPORTANT:
- Enable đúng 1 thread group mỗi lần chạy (trừ Phase 7 - xem docs).
- Tất cả endpoint dùng /virtual/lock (lựa chọn production) để kết quả có nghĩa.</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.name">host</stringProp>
            <stringProp name="Argument.value">${__P(host,localhost)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="port" elementType="Argument">
            <stringProp name="Argument.name">port</stringProp>
            <stringProp name="Argument.value">${__P(port,8080)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="protocol" elementType="Argument">
            <stringProp name="Argument.name">protocol</stringProp>
            <stringProp name="Argument.value">${__P(protocol,http)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="connectTimeoutMs" elementType="Argument">
            <stringProp name="Argument.name">connectTimeoutMs</stringProp>
            <stringProp name="Argument.value">${__P(connectTimeoutMs,5000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="responseTimeoutMs" elementType="Argument">
            <stringProp name="Argument.name">responseTimeoutMs</stringProp>
            <stringProp name="Argument.value">${__P(responseTimeoutMs,15000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="resultDir" elementType="Argument">
            <stringProp name="Argument.name">resultDir</stringProp>
            <stringProp name="Argument.value">${__P(resultDir,${__BeanShell(new java.io.File(org.apache.jmeter.services.FileServer.getFileServer().getBaseDir()\, "results").getAbsolutePath())})}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="idemTxnId" elementType="Argument">
            <stringProp name="Argument.name">idemTxnId</stringProp>
            <stringProp name="Argument.value">${__P(idemTxnId,idem-fixed-txn-001)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="idemCustomerId" elementType="Argument">
            <stringProp name="Argument.name">idemCustomerId</stringProp>
            <stringProp name="Argument.value">${__P(idemCustomerId,customer-idempotency-001)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="idemAmount" elementType="Argument">
            <stringProp name="Argument.name">idemAmount</stringProp>
            <stringProp name="Argument.value">${__P(idemAmount,50)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="idemThreads" elementType="Argument">
            <stringProp name="Argument.name">idemThreads</stringProp>
            <stringProp name="Argument.value">${__P(idemThreads,40)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="idemLoops" elementType="Argument">
            <stringProp name="Argument.name">idemLoops</stringProp>
            <stringProp name="Argument.value">${__P(idemLoops,20)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="soakThreads" elementType="Argument">
            <stringProp name="Argument.name">soakThreads</stringProp>
            <stringProp name="Argument.value">${__P(soakThreads,200)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="soakRampUpSec" elementType="Argument">
            <stringProp name="Argument.name">soakRampUpSec</stringProp>
            <stringProp name="Argument.value">${__P(soakRampUpSec,60)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="soakDurationSec" elementType="Argument">
            <stringProp name="Argument.name">soakDurationSec</stringProp>
            <stringProp name="Argument.value">${__P(soakDurationSec,1800)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="soakProfileCount" elementType="Argument">
            <stringProp name="Argument.name">soakProfileCount</stringProp>
            <stringProp name="Argument.value">${__P(soakProfileCount,5000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="stressRampUpSec" elementType="Argument">
            <stringProp name="Argument.name">stressRampUpSec</stringProp>
            <stringProp name="Argument.value">${__P(stressRampUpSec,30)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="stressLoops" elementType="Argument">
            <stringProp name="Argument.name">stressLoops</stringProp>
            <stringProp name="Argument.value">${__P(stressLoops,30)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="stressProfileCount" elementType="Argument">
            <stringProp name="Argument.name">stressProfileCount</stringProp>
            <stringProp name="Argument.value">${__P(stressProfileCount,10000)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="stressMinAmount" elementType="Argument">
            <stringProp name="Argument.name">stressMinAmount</stringProp>
            <stringProp name="Argument.value">${__P(stressMinAmount,20)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="stressMaxAmount" elementType="Argument">
            <stringProp name="Argument.name">stressMaxAmount</stringProp>
            <stringProp name="Argument.value">${__P(stressMaxAmount,200)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <stringProp name="HTTPSampler.connect_timeout">${connectTimeoutMs}</stringProp>
        <stringProp name="HTTPSampler.response_timeout">${responseTimeoutMs}</stringProp>
        <stringProp name="HTTPSampler.domain">${host}</stringProp>
        <stringProp name="HTTPSampler.port">${port}</stringProp>
        <stringProp name="HTTPSampler.protocol">${protocol}</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
      </ConfigTestElement>
      <hashTree/>

      <!-- ============ Phase 4 - Idempotency ============ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="P4-A Idempotency same-txnId (virtual lock)" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${idemThreads}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${idemLoops}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/rewards/virtual/lock (idempotency)" enabled="true">
          <stringProp name="HTTPSampler.path">/api/rewards/virtual/lock</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;customerId&quot;:&quot;${idemCustomerId}&quot;,&quot;transactionId&quot;:&quot;${idemTxnId}&quot;,&quot;amount&quot;:${idemAmount}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert status SUCCESS or DUPLICATE_TRANSACTION" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">&quot;status&quot;:&quot;SUCCESS&quot;</stringProp>
              <stringProp name="1">&quot;status&quot;:&quot;DUPLICATE_TRANSACTION&quot;</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">18</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Writer - p4-a-idempotency" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${resultDir}/p4-a-idempotency.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <!-- ============ Phase 5 - Soak / Endurance ============ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="P5 Soak 30min virtual lock" enabled="false">
        <stringProp name="ThreadGroup.num_threads">${soakThreads}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${soakRampUpSec}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </elementProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${soakDurationSec}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/rewards/virtual/lock (soak)" enabled="true">
          <stringProp name="HTTPSampler.path">/api/rewards/virtual/lock</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;customerId&quot;:&quot;soak-user-${__Random(1,${soakProfileCount},)}&quot;,&quot;transactionId&quot;:&quot;txn-soak-${__threadNum}-${__counter(TRUE,)}-${__time(yyyyMMddHHmmssSSS,)}&quot;,&quot;amount&quot;:${__Random(${stressMinAmount},${stressMaxAmount},)}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Writer - p5-soak-virtual-lock" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${resultDir}/p5-soak-virtual-lock.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <!-- ============ Phase 6 - Stress Step Load (knee-point finder) ============ -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="P6-A Stress 100 users virtual lock" enabled="false">
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${stressRampUpSec}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${stressLoops}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/rewards/virtual/lock (stress-100)" enabled="true">
          <stringProp name="HTTPSampler.path">/api/rewards/virtual/lock</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;customerId&quot;:&quot;stress-user-${__Random(1,${stressProfileCount},)}&quot;,&quot;transactionId&quot;:&quot;txn-stress-100-${__threadNum}-${__counter(TRUE,)}&quot;,&quot;amount&quot;:${__Random(${stressMinAmount},${stressMaxAmount},)}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Writer - p6-a-stress-100" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${resultDir}/p6-a-stress-100.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="P6-B Stress 500 users virtual lock" enabled="false">
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${stressRampUpSec}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${stressLoops}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/rewards/virtual/lock (stress-500)" enabled="true">
          <stringProp name="HTTPSampler.path">/api/rewards/virtual/lock</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;customerId&quot;:&quot;stress-user-${__Random(1,${stressProfileCount},)}&quot;,&quot;transactionId&quot;:&quot;txn-stress-500-${__threadNum}-${__counter(TRUE,)}&quot;,&quot;amount&quot;:${__Random(${stressMinAmount},${stressMaxAmount},)}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Writer - p6-b-stress-500" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${resultDir}/p6-b-stress-500.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="P6-C Stress 1000 users virtual lock" enabled="false">
        <stringProp name="ThreadGroup.num_threads">1000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${stressRampUpSec}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${stressLoops}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/rewards/virtual/lock (stress-1000)" enabled="true">
          <stringProp name="HTTPSampler.path">/api/rewards/virtual/lock</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;customerId&quot;:&quot;stress-user-${__Random(1,${stressProfileCount},)}&quot;,&quot;transactionId&quot;:&quot;txn-stress-1000-${__threadNum}-${__counter(TRUE,)}&quot;,&quot;amount&quot;:${__Random(${stressMinAmount},${stressMaxAmount},)}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Writer - p6-c-stress-1000" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${resultDir}/p6-c-stress-1000.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="P6-D Stress 2000 users virtual lock" enabled="false">
        <stringProp name="ThreadGroup.num_threads">2000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${stressRampUpSec}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${stressLoops}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/rewards/virtual/lock (stress-2000)" enabled="true">
          <stringProp name="HTTPSampler.path">/api/rewards/virtual/lock</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;customerId&quot;:&quot;stress-user-${__Random(1,${stressProfileCount},)}&quot;,&quot;transactionId&quot;:&quot;txn-stress-2000-${__threadNum}-${__counter(TRUE,)}&quot;,&quot;amount&quot;:${__Random(${stressMinAmount},${stressMaxAmount},)}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Writer - p6-d-stress-2000" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${resultDir}/p6-d-stress-2000.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <!-- ============ Phase 7 - Chaos / Availability test ============ -->
      <!-- Phase 7 dùng chung endpoint với P5 nhưng chạy song song với script chaos bên ngoài.
           Mục tiêu: verify circuit breaker Redis → MySQL fallback khi Redis chết giữa load. -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="P7 Chaos virtual lock (run with chaos/redis-down.sh)" enabled="false">
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">-1</stringProp>
          <boolProp name="LoopController.continue_forever">true</boolProp>
        </elementProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">180</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/rewards/virtual/lock (chaos)" enabled="true">
          <stringProp name="HTTPSampler.path">/api/rewards/virtual/lock</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;customerId&quot;:&quot;chaos-user-${__Random(1,1000,)}&quot;,&quot;transactionId&quot;:&quot;txn-chaos-${__threadNum}-${__counter(TRUE,)}-${__time(yyyyMMddHHmmssSSS,)}&quot;,&quot;amount&quot;:${__Random(20,200,)}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Writer - p7-chaos" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${resultDir}/p7-chaos.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>